// 크레이트(crate) : 러스트 컴파일러가 “한 번에 같이 컴파일하는 코드의 단위”
// main.rs나 lib.rs 파일이 있는 디렉터리가 크레이트 루트(crate root)가 됨
// 이 예제에서는 backyard가 크레이트 이름이자 루트 디렉터리
// backyard가 실행 파일(main.rs)만 있으면 다른 크레이트에서 코드를 가져올 수 없음


/*
디렉터리 구조
backyard
└── src
    ├── main.rs      ← crate root
    ├── garden.rs
    └── garden/
        └── vegetables.rs

컴파일러 관점

crate (이름: backyard)
│
├── main.rs   ← 여기서 시작
│
└── garden
    └── vegetables
*/

// 컴파일러에게 src/garden.rs에 있는 코드를 포함할 것을 알려줌
// 이 크레이트/모듈에 garden이라는 하위 모듈이 존재한다는 선언
pub mod garden;

// 경로 단축
use crate::garden::vegetables::Asparagus;

pub fn supply_asparagus() -> Asparagus {
    println!("🚜 [Backyard] 밭에서 싱싱한 아스파라거스를 수확합니다.");
    Asparagus::new(101, 3) // ID 101, 3단 수확
}